color_dict = {
        '微弱的不完整膜阳性肿瘤细胞':(100, 0, 255),
             '1': (181, 53, 236),
             '2': (13, 250, 199),
             '3': (201, 64, 30),
             '4': (205, 255, 228),
             '5': (184, 189, 2),
             '6': (124, 210, 54),
             '7': (0, 0, 255),
             '8': (30, 100, 178),
        '弱-中等的完整细胞膜阳性肿瘤细胞': (181, 53, 236),
        '阴性肿瘤细胞': (13, 250, 199),
        '纤维细胞': 3,
        '淋巴细胞': 4,
        '难以区分的非肿瘤细胞': 5,
        '组织细胞': 6,
        '强度的完整细胞膜阳性肿瘤细胞': 7,
        '中-强度的不完整细胞膜阳性肿瘤细胞': 8

    }